Repository: 84000/data-translation-memory
Catalog: toh65-v3.tmx
Source language: bo
Languages: en

source: འགྱོད་པ་ཀུན་ནས་ལྡང་བ་རྣམ་པར་གནོན་པ་དང་། མཁས་པ་དང་ཤེས་རབ་ཆེན་པོ་ལ་བསྙེན་བཀུར་བྱེད་པ་དང་། ཐོས་པའི་དོན་སེམས་པ་དང་། གཞན་གྱི་ཉེས་བ་མི་གླེང་ཞིང་གླེང་བ་གང་ཡིན་པ་ཡང་བྱམས་པས་གླེང་གི་སྐྱོན་གཙོར་བྱེད་པས་མ་ཡིན་པ་སྟེ།
en: Overcoming regret wherever it arises, venerating those with great erudition and insight, thinking about the meaning of what has been learned, and not talking about the faults of others—being kind in discussions and not emphasizing faults.

source: བཟང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཕན་ཡོན་བཞི་པོ་འདི་དག་མཐོང་ན་ཐོས་པ་ཚོལ་བར་བྱེད་དེ།
en: “Bhadra, when bodhisattvas are seen to have these four beneficial qualities, they are sought after for their learning.

source: བདག་དང་གཞན་གྱི་ཤེས་རབ་སྦྱོང་བ་དང་། ཕྱོགས་བཞི་ནས་ལྷགས་པ་རྣམས་ཀྱི་ཐེ་ཚོམ་གཅོད་པ་དང་། དམ་པའི་ཆོས་འཛིན་པ་དང་། སངས་རྒྱས་ཀྱི་བསྔགས་པ་ཟད་མི་ཤེས་པ་སྟེ།
en: Developing insight in oneself and others, removing doubts that come from all directions, grasping the holy Dharma, and never tiring of praising the buddhas.

source: བཟང་པོ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མང་དུ་ཐོས་པའི་སྙིང་པོ་ཡིན་ནོ། །
en: “Bhadra, these four are the essences of the bodhisattvas’ vast learning.

source: ཐོས་ནས་ཆོས་བྱེ་བྲག་ཏུ་ཤེས་པ་འདི་ནི་འདིའི་སྙིང་པོ་ཡིན་ནོ། །
en: Being learned, they know the Dharma in detail; this is an essence.

source: ཐོས་ནས་བྱ་བ་མ་ཡིན་པ་མི་བྱེད་པ་འདི་ནི་འདིའི་སྙིང་པོ་ཡིན་ནོ། །
en: Being learned, they refrain from what should not be done; this is an essence.

source: ཐོས་ནས་གཞན་ལ་སྟོན་པར་བྱེད་པ་འདི་ནི་འདིའི་སྙིང་པོ་ཡིན་ནོ། །
en: Being learned, they teach others; this is an essence.

source: ཐོས་ནས་དོན་དེ་ཉིད་རྣམ་པར་གྲོལ་བ་འདི་ལྟ་སྟེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་བྱང་ཆུབ་ལ་གཏོད་པར་བྱེད་པ་འདི་ནི་འདིའི་སྙིང་པོ་ཡིན་ཏེ།
en: And being learned, they focus on the ultimate liberation and awakening of blessed buddhas; this is an essence.

source: བཟང་པོ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་སྟོན་པར་བྱེད་པའི་ཕན་ཡོན་ཡིན་ཏེ།
en: “Bhadra, these four are the benefits for bodhisattvas who teach the Dharma.

source: བཞི་གང་ཞེ་ན། ལས་བྱས་ནས་ཀྱང་ཟས་ལ་ཡོངས་སུ་སྤྱོད་པ་དང་། ཆོས་གོས་དང་། བསོད་སྙོམས་དང་། མལ་ཆ་དང་།
en: What are the four?

source: སྟན་དང་། ནད་གསོས་དང་། སྨན་ཟོང་རྣམས་རྙེད་པ་དང་། གཞན་གྱི་ཕྱོགས་མཐུ་ཆུང་བར་བྱེད་པ་དང་། ཆོས་འདོད་པའི་ལྷ་རྣམས་ཕྱི་བཞིན་འབྲང་ཞིང་དེ་དག་གིས་བསྲུངས་པས་བདུད་ཀྱིས་གླགས་མི་རྙེད་པ་སྟེ།
en: Enjoying a meal after working; receiving robes, alms, bedding, seats, and medicines to cure the sick; weakening the power of opponents; and being attended upon and protected by gods who favor the Dharma, so that they are invulnerable to Māra.

source: བཟང་པོ་བཞི་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་སྟོན་པར་བྱེད་པའི་ཕན་ཡོན་ཡིན་ནོ། །
en: Bhadra, these four are the benefits for the bodhisattvas who teach the Dharma.

source: བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་གཞན་དག་ལ་ཆོས་སྟོན་པར་བྱེད་ཅིང་འདིའི་ཚིག་གི་ལམ་གཟུང་བར་འོས་པར་ཡང་འགྱུར་ཏེ།
en: “If bodhisattvas have these four qualities, when they teach the Dharma to others their words will be worth hearing.

source: འདོད་པ་ཆུང་བ་དང་། ཆོག་ཤེས་པ་དང་། ངང་ཚུལ་བཟང་ཞིང་མཉེན་པ་དང་། བདག་ཉིད་ཀྱི་ཆོས་སྒྲུབ་པ་སྟེ།
en: Having few desires, a sense of contentment, and a good and gentle nature and accomplishing their own spiritual practice.

source: བཟང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་ཤེས་ཀྱི་ཁེ་ལས་འབྱོལ་ཞིང་ཟང་ཟིང་མེད་པར་ཆོས་སྟོན་པ་ཡང་ཡིན་ཏེ།
en: “Bhadra, when bodhisattvas have these four qualities, they teach the Dharma while avoiding profiting from their knowledge and without concern for material things.

source: འཁོར་བ་ལས་འཇིགས་པ་སྐྱེད་པ་དང་། འཇིག་རྟེན་གྱི་ཟང་ཟིང་དང་འདུ་འཛི་དོན་དུ་མི་གཉེར་བ་དང་། ཕ་རོལ་རྗེས་སུ་སྲུང་བ་དང་། འཕགས་པའི་རིགས་ལ་གནས་པ་སྟེ།
en: Dispelling the fear of saṃsāra, taking no interest in worldly goods or distractions, looking out for others, and abiding by the noble lineage.

source: བཟང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་བྱས་པ་གཟོ་བ་དང་། བྱས་པ་ཚོར་བ་དང་། བྱས་པ་ལ་ལན་དུ་ཕན་འདོགས་པ་ཡིན་ཏེ།
en: “Bhadra, when bodhisattvas have these four qualities, they are grateful and thankful for what they receive and are of benefit in return.

source: གཞན་བྱང་ཆུབ་ཡང་དག་པར་ལེན་དུ་འཇུག་པ་དང་། ལས་བྱས་པ་ཆུད་མི་གཟོན་པ་དང་། བདག་ཉིད་ལ་བྱམས་པ་ལྟར་གཞན་ལ་ཡང་བྱམས་པ་དང་། སྐྱེས་བུ་དམ་པའི་རྩལ་དོན་དུ་གཉེར་བ་སྟེ།
en: Encouraging others toward awakening, not allowing former deeds to go to waste, treating others with the kindness one gives oneself, and aspiring to the skill of a holy being.

source: བཟང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་སེམས་ཅན་རྣམས་ལ་མཛའ་བཤེས་མི་ཕྱེད་པར་འགྱུར་ཏེ།
en: “Bhadra, when bodhisattvas have these four qualities, they will be inseparable friends to beings.

source: བཟོད་པའི་སྟོབས་ཀྱི་གོ་བགོས་པ་དང་། ལན་དུ་ཕན་འདོགས་པར་ཅུང་ཟད་ཀྱང་རེ་བ་མེད་པ་དང་། སྙིང་རྗེ་ཆེན་པོ་མི་འདོར་བ་དང་། ལོག་པར་ཞུགས་པ་རྣམས་མི་སྤོང་བ་སྟེ།
en: Putting on the armor of the strength of acceptance, having no hope for the slightest benefit in return, not forsaking great compassion, and not giving up on those who have entered erroneous ways.

source: བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་སེམས་ཅན་རྣམས་ལ་མཛའ་བཤེས་མི་ཕྱེད་པར་འགྱུར་རོ། །
en: Bodhisattvas with these four qualities will be inseparable friends to beings.

source: བཟང་པོ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔས་བསྟེན་པར་བྱ་བའི་གྲོགས་པོ་ཡིན་ཏེ།
en: “Bhadra, these four are the friends upon whom bodhisattvas should rely.

source: སྦྱོར་བ་ཕུན་སུམ་ཚོགས་པ་དང་། བསམ་པ་ཕུན་སུམ་ཚོགས་པ་དང་། སྤྱོད་པ་ཕུན་སུམ་ཚོགས་པ་དང་། གང་དག་འདིའི་བྱང་ཆུབ་ཉེ་བར་སྟོན་པར་བྱེད་པ་སྟེ།
en: Perfect application, perfect intention, perfect conduct, and doing that which reveals this awakening to others.

source: བཟང་པོ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མི་དགེ་བའི་གྲོགས་པོ་ཡིན་པར་རིག་པར་བྱ་སྟེ།
en: “Bhadra, these four should be known as nonvirtuous companions for bodhisattvas.

source: ཐེག་པ་དམན་པ་སྟོན་པ་དང་། བྱང་ཆུབ་ཀྱི་སེམས་ལ་འདུན་པ་ཟློག་པར་བྱེད་པ་དང་། གང་དག་བསྟེན་ན་མི་དགེ་བའི་ཆོས་འཕེལ་བར་འགྱུར་བ་དང་། དགེ་བའི་ཆོས་རྣམས་ཡོངས་སུ་ཉམས་པར་འགྱུར་བ་སྟེ།
en: Teachers of the Lesser Vehicle; those who divert those inclined toward the mind of awakening; those who, when relied upon, cause nonvirtuous qualities to increase; and those who cause virtuous qualities to decrease.

source: བཟང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་ཕྲད་པར་འགྱུར་རོ། །
en: “Bhadra, when bodhisattvas have these four qualities, they will meet with blessed buddhas.

source: དྲན་པ་རྩེ་གཅིག་པ་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་བསྔགས་པ་ཡང་དང་ཡང་དུ་སྒྲོགས་པ་དང་། ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པ་དང་། ལྷག་པའི་བསམ་པས་སྨོན་ལམ་འདེབས་པ་སྟེ།
en: Single-pointed mindfulness, proclaiming again and again the praises of the blessed buddhas, completely pure discipline, and making aspirations with superior motivation.

source: བཟང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཕན་ཡོན་བཞི་པོ་འདི་དག་མཐོང་ན་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་བྱ་བར་སྤྲོ་བར་འགྱུར་ཏེ།
en: “Bhadra, when bodhisattvas see these four benefits, they will take delight in acts of offering to the tathāgatas.

source: ཡོན་གནས་མཆོག་ལ་མཆོད་པར་འགྱུར་བ་དང་། བདག་མཐོང་ནས་སེམས་ཅན་གཞན་དག་ཀྱང་དེ་བཞིན་དུ་མཆོད་པ་བྱེད་པར་འགྱུར་བ་དང་། དེ་བཞིན་གཤེགས་པ་ལེགས་པར་མཆོད་ན་བྱང་ཆུབ་ཀྱི་སེམས་བརྟན་པར་འགྱུར་བ་དང་། སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་ལྡན་པ་མངོན་སུམ་དུ་མཐོང་ན་དགེ་བའི་རྩ་བ་སོགས་པར་འགྱུར་བ་སྟེ།
en: That offerings are made to the supreme object of offering; that when they are seen making offerings, other beings make offerings in the same way; that when offerings to the tathāgatas are made in the right way, the mind of awakening becomes stable; and that when a great being with the thirty-two marks is seen directly, roots of virtue are accumulated.

source: བཟང་པོ་བྱང་ཆུབ་སེམས་དཔས་ཕན་ཡོན་བཞི་པོ་དེ་དག་མཐོང་ན་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་བྱ་བར་སྤྲོ་བར་འགྱུར་རོ། །
en: Bhadra, when bodhisattvas see these four benefits, they will delight in making offerings to the tathāgatas.

source: བཟང་པོ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔས་དོན་གྱི་དབང་བཞི་མཐོང་ན་བསླབ་པ་ལྷུར་ལེན་པར་འགྱུར་ཏེ།
en: “Likewise, Bhadra, when bodhisattvas see these four objectives, they will be diligent in their training.

source: ངན་འགྲོ་ལས་ཡང་དག་པར་འདའ་བ་དང་། བདེ་འགྲོ་འཐོབ་པར་འགྱུར་བ་དང་། དེ་བཞིན་གཤེགས་པ་ལ་གུས་པ་དང་། སྨོན་ལམ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་སྟེ།
en: Passing beyond bad rebirths, achieving happy rebirths, respecting the tathāgatas, and completely fulfilling aspirations.

source: བཟང་པོ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསླབ་པ་ཡིན་ཏེ།
en: “Bhadra, these four are the trainings of bodhisattvas.

source: བྱང་ཆུབ་ཀྱི་སེམས་མི་འདོར་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་མཉམ་པར་སྦྱོར་བ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་ཚོལ་བ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཚད་མེད་པ་མཉན་པ་ལ་མི་སྐྲག་པ་སྟེ།
en: Never relinquishing the mind of awakening, being equanimous toward all beings, fully pursuing the perfections, and not being afraid to listen to the immeasurable Buddhadharma.

source: བཟང་པོ་བཞི་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསླབ་པ་ཡིན་ནོ། །
en: Bhadra, these four are the trainings of bodhisattvas.

source: བཟང་པོ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསླབ་པ་ཡོངས་སུ་དག་པ་ཡིན་ཏེ།
en: “Bhadra, these four are the perfectly pure trainings of bodhisattvas.

source: བྱ་བ་མ་ཡིན་པ་མི་སྤྱོད་པ་དང་། སྟོང་པ་ཉིད་ལ་མོས་པ་དང་། སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་མི་སྤོང་བ་དང་། ལྟ་བ་བག་ལ་ཉལ་དང་བཅས་པར་ཡང་དག་པར་འཇོམས་པ་སྟེ།
en: Not doing what should not be done, having faith in emptiness, not abandoning the awakening of the buddhas, and completely vanquishing views along with their latent tendencies.

source: བཟང་པོ་བཞི་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསླབ་པ་ཡོངས་སུ་དག་པ་ཡིན་ནོ། །
en: Bhadra, those four are the completely pure trainings of bodhisattvas.

source: བཟང་པོ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་རིགས་ཡིན་ཏེ།
en: “Bhadra, these four are the four aspects of the samādhi of bodhisattvas.

source: འདུ་འཛི་མེད་པ་དང་། རབ་ཏུ་དབེན་པ་དང་། སེམས་ཀྱི་རྙོག་པ་མེད་པ་དང་། དགེ་བའི་རྩ་བ་ཉེ་བར་སྟོན་པ་སྟེ།
en: Being without distraction, remaining in solitude, having an untroubled mind, and relying on the roots of virtue.

source: བཟང་པོ་བཞི་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་རིགས་ཡིན་ནོ། །
en: Bhadra, these four are the aspects of the samādhi of bodhisattvas.

source: བཟང་པོ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚུལ་བཞིན་རབ་ཏུ་སྦྱོར་བ་ཡིན་ཏེ།
en: “Bhadra, these four are the proper modes of engagement of bodhisattvas.

source: དགེ་བའི་རྩ་བ་སྐྱེས་ནས་བྱང་ཆུབ་ཀྱི་སེམས་མངོན་དུ་བྱེད་པ་དང་། ནང་དུ་ཡང་དག་འཇོག་པ་ལ་སྒྲིབ་པ་མེད་པ་དང་། རྣམ་པར་ཐར་བའི་སྒོ་དག་ལ་འདྲིས་པར་བྱེད་པ་དང་།
en: Actualizing the mind of awakening once the roots of virtues have been produced, being without obscuration when entering complete absorption, being familiar with the gateways to liberation, and not entering into fixity.

source: ངེས་པ་ལ་མི་འཇུག་པ་སྟེ། བཟང་པོ་བཞི་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚུལ་བཞིན་རབ་ཏུ་སྦྱོར་བ་ཡིན་ནོ། །
en: Bhadra, these four are the proper modes of engagement of bodhisattvas.

source: བཟང་པོ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚུལ་བཞིན་མ་ཡིན་པའི་སེམས་སྐྱེ་བ་བཟློག་པར་བྱ་བ་ཡིན་ཏེ།
en: “Bhadra, these four are the improper mindsets of bodhisattvas that should be rejected.

source: འཁོར་བའི་འཇིགས་པས་སྐྲག་པ་དང་། རྣལ་འབྱོར་སྤྱོད་པ་དག་ལ་མ་མོས་པ་དང་། དགོངས་པ་དག་ལ་མི་དགའ་བ་དང་། དགེ་བའི་རྩ་བ་རྣམས་མངོན་པར་འདུ་མི་བྱེད་པ་སྟེ།
en: Being afraid of the horrors of saṃsāra, being uninterested in yogic activities, being uninterested in the intended meaning of the teachings, and not accumulating roots of virtue.

source: བཟང་པོ་བཞི་པོ་དེ་དག་ནི་ཚུལ་བཞིན་མ་ཡིན་པའི་སེམས་སྐྱེ་བ་བཟློག་པར་བྱ་བ་ཡིན་ནོ། །
en: Bhadra, these four are the improper mindsets that should be rejected.

source: བཟང་པོ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་ཀྱིས་ངེས་པར་བསམ་པ་ཡིན་ཏེ།
en: “Bhadra, these four are the resolutions of bodhisattvas.

source: སེམས་ཅན་འགའི་དོན་གྱི་ཕྱིར་ཡང་བསྐལ་པ་ཕྱི་མའི་མཐར་ཐུག་པར་འཁོར་བ་ན་འཁོར་བར་བྱའོ་སྙམ་པ་འདི་ནི་སེམས་ཀྱིས་ངེས་པར་བསམ་པ་དང་པོ་ཡིན་ནོ། །
en: The first resolution is the thought, ‘Even for the sake of a single being, I will cycle in saṃsāra until the end of the final eon.’

source: བདག་གིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་སྤྱོད་པ་རྣམས་ཤེས་པར་བྱ་ཞིང་དེ་དག་གི་ཉོན་མོངས་པ་རབ་ཏུ་ཞི་བར་བྱ་བ་དང་། དབང་པོ་མཆོག་དང་མཆོག་མ་ཡིན་པ་ཤེས་པར་བྱ་བའི་ཕྱིར་ཆོས་བསྟན་པར་བྱའོ་སྙམ་པ་འདི་ནི་སེམས་ཀྱིས་ངེས་པར་བསམ་པ་གཉིས་པ་ཡིན་ནོ། །
en: The second resolution is the thought, ‘I will teach the Dharma in order to know the thoughts of all beings, pacify their afflictions, and know the superior and inferior faculties.’

source: བདག་གིས་མི་དགེ་བའི་ཆོས་ཐམས་ཅད་སྤངས་ཤིང་དགེ་བའི་ཆོས་ཐམས་ཅད་དང་ལྡན་པར་བྱས་ནས་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་སྟེ། བདུད་ཀྱི་དཔུང་ཕམ་པར་བྱས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱའོ་སྙམ་པ་འདི་ནི་སེམས་ཀྱིས་ངེས་པར་བསམ་པ་གསུམ་པ་ཡིན་ནོ། །
en: The third resolution is the thought, ‘May I, having relinquished all nonvirtuous qualities and become endowed with all virtuous qualities, reach the seat of awakening and, having defeated the hordes of Māra, fully awaken to unsurpassed, complete and perfect buddhahood.’

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་སྐད་ཅིག་གཅིག་གིས་གོ་བར་བྱས་ཏེ་ཆོས་བསྟན་པར་བྱའོ་སྙམ་པ་འདི་ནི་སེམས་ཀྱིས་ངེས་པར་བསམ་པ་བཞི་པ་ཡིན་ཏེ།
en: The fourth resolution is the thought, ‘Having understood the entire trichiliocosm in a single moment, may I teach the Dharma.’

source: བཟང་པོ་བཞི་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་ཀྱིས་ངེས་པར་བསམ་པ་ཡིན་ནོ། །
en: Bhadra, these four are the resolutions of bodhisattvas.

source: བཟང་པོ་ཆོས་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བདུད་འདུལ་བ་ཡིན་ཏེ།
en: “Bhadra, these four qualities of bodhisattvas subdue Māra.

source: ཆོས་ལ་སྒྱུ་མ་ལྟ་བུར་སོ་སོར་རྟོག་པ་དང་། ཚུལ་བཞིན་དུ་སྦྱོར་བ་དང་། ཆོས་ཐམས་ཅད་ལ་རྣམ་པར་མི་རྟོག་པ་དང་། མཚན་མ་ཐམས་ཅད་ལ་མི་གནས་པ་སྟེ།
en: Discerning every phenomenon as being like an illusion, having proper engagement, not conceptualizing phenomena, and not abiding in any characteristics.

source: བཟང་པོ་ཆོས་བཞི་པོ་དེ་དག་ནི་བདུད་འདུལ་བ་ཡིན་ནོ། །
en: Bhadra, these four are the qualities of bodhisattvas that subdue Māra.

source: བཟང་པོ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དོན་སེམས་པ་ཡིན་ཏེ།
en: “Bhadra, these four are the truths to be contemplated for bodhisattvas.

source: གང་ཟག་མེད་པའི་ཕྱིར་ཆོས་རྣམས་བརྟེན་ནས་སྐྱེ་བ་ཡིན་གྱི་ཆོས་འགའ་ཡང་རྒྱུ་མེད་པར་ནི་མི་སྐྱེ་བ་དང་། བརྟེན་ནས་སྐྱེ་བའི་ཆོས་གང་ཡིན་པ་དེ་མ་སྐྱེས་པ་དང་། དངོས་པོ་མེད་པ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱིར་ཆུད་མི་ཟ་བ་སྟེ།
en: There are no persons; phenomena arise in dependence; no phenomenon whatsoever arises without a cause; and phenomena that arise in dependence are unborn and insubstantial, and on account of awakening they are inexhaustible.

source: བཟང་པོ་བཞི་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དོན་སེམས་པ་ཡིན་ནོ། །
en: Bhadra, these four are the truths to be contemplated by bodhisattvas.

source: བཟང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་སེམས་ཅན་རྣམས་མི་གཏོང་བ་ཡིན་ཏེ།
en: “Bhadra, when bodhisattvas have four qualities, they do not abandon beings.

source: སྔོན་གྱི་སྨོན་ལམ་མི་འདོར་བ་དང་། ཡོངས་སུ་སྐྱོ་བ་བཟོད་པ་དང་། ལུས་དང་སྲོག་ལ་མི་ལྟ་བ་དང་། བསྡུ་བའི་དངོས་པོས་སྡུད་པ་སྟེ།
en: Not abandoning previous aspirations, enduring weariness, not concerning themselves with their own body and life, and employing the means of attracting disciples.

source: བཟང་པོ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་ཡིན་ཏེ།
en: “Bhadra, these four are the bodhisattvas’ four ripening acts.

source: འཇིག་རྟེན་གྱི་ཟང་ཟིང་སྦྱིན་པ་ཡོངས་སུ་གཏོང་བ་དང་། ཡོངས་སུ་སྨིན་པ་ལ་ཆོས་སྟོན་པ་ཡོངས་སུ་གཏོང་བ་དང་། དུས་དུས་སུ་སྐུལ་བས་དྲན་པར་བྱེད་པ་ཡོངས་སུ་གཏོང་བ་དང་། བདག་ཉིད་ཀྱི་བདེ་བ་སྤངས་ནས་གཞན་གྱི་དགེ་བའི་རྩ་བ་སྟོན་པ་དང་། ཡོངས་སུ་སྨིན་པར་བྱེད་པ་སྟེ།
en: Giving material goods, giving Dharma teachings for the sake of ripening others, regularly giving reminders by encouraging others, and, by giving up their own happiness, revealing the roots of virtue in others and causing them to ripen.

source: བཟང་པོ་བཞི་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་ཡིན་ནོ། །
en: Bhadra, these four are the bodhisattvas’ four ripening acts.

source: བཟང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་མ་བསྡུས་པ་སྡུད་པར་བྱེད་པ་ལ་མི་འཇིགས་པ་ཡིན་ཏེ།
en: “Bhadra, when bodhisattvas have four qualities, they are not afraid to gather disciples who have not yet been gathered.

source: དགེ་བའི་རྩ་བ་ཆུང་ངུ་ལ་ཡང་མོས་པ་དང་། རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་གཞན་གྱི་དོན་བྱེད་པར་སྤྲོ་བ་དང་། སྦྱིན་པ་དང་། དུལ་བ་དང་། དེས་པ་ཕུན་སུམ་ཚོགས་པ་དང་། རྙེད་པ་དང་། བཀུར་སྟི་དང་། ཚིགས་སུ་བཅད་པ་ཐམས་ཅད་ལ་དོན་དུ་གཉེར་བ་མེད་པ་སྟེ།
en: Being inclined to even the slightest root of virtue; taking delight in always and unceasingly benefiting others; being perfectly generous, restrained, and gentle; and disregarding all profit, veneration, and praise.

source: བཟང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་སེམས་ཅན་གྱི་སྤྱོད་པ་ལ་འཇུག་པ་ཡིན་ཏེ།
en: “Bhadra, when bodhisattvas have four qualities, they engage in proper conduct.

source: བཞི་གང་ཞེ་ན། མངོན་པར་ཤེས་པ་ཐོབ་པ་དང་།
en: What are the four?

source: ཡེ་ཤེས་ཐོབ་པ་དང་། ཏིང་ངེ་འཛིན་ཆེན་པོར་གྱུར་པ་ཚད་མེད་པ་ལ་འཇུག་པ་དང་། རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པའི་སྟོང་པ་ཉིད་སྒོམ་ཞིང་རྣམ་པར་གྲོལ་བ་དང་མ་འདྲེས་པ་སྟེ།
en: The attainment of the superknowledges, the attainment of wisdom, engaging in the immeasurable great samādhi, and being fully liberated without contamination by meditating on emptiness supreme in all aspects.

source: བཟང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་ཐབས་ལ་མཁས་པ་ཡིན་པར་རིག་པར་བྱ་སྟེ།
en: “Bhadra, when bodhisattvas have four qualities, they will know that they are skillful in means.

source: སེམས་བསྐྱེད་པ་ཐམས་ཅད་ལ་བྱང་ཆུབ་ཀྱི་སེམས་སྔོན་དུ་འགྲོ་བ་སྟེ། ཐ་ན་ཉོན་མོངས་པའི་སེམས་ལ་ཡང་རུང་ན་དགེ་བའི་སེམས་ལ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཆོས་ཀྱི་སྣོད་ཉིད་ཡིན་པར་ལྟ་བ་དང་། ངོ་བོ་ཉིད་མེད་པར་ཁོང་དུ་ཆུད་པས་ཆོས་ཐམས་ཅད་ལོག་པ་ཉིད་དུ་ངེས་པ་ཡིན་པར་ལྟ་བ་དང་། རྣམ་པར་གྲོལ་བར་འདོད་པས་སྙོམས་པར་འཇུག་པ་ཐམས་ཅད་ལ་མངོན་པར་ཞེན་པ་མེད་པའི་འདུ་ཤེས་སྒོམ་པར་བྱེད་པ་སྟེ།
en: Knowing that all thoughts lead to the mind of awakening—even afflicted thoughts are sufficient, not to mention virtuous thoughts; viewing all beings as the very vessels of Dharma; holding the view, by understanding essencelessness, that all phenomena are definitely erroneous; and meditating with a perception that does not fixate on any meditative absorptions when seeking liberation.

source: བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་ཐབས་ལ་མཁས་པ་ཡིན་པར་རིག་པར་བྱའོ། །
en: When bodhisattvas have these four qualities, they will know they are skilled in means.

source: བཟང་པོ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱམས་པ་སྒོམ་པ་ཡིན་ཏེ།
en: “Bhadra, these four are bodhisattvas’ meditations on loving-kindness.

source: བདག་གིས་སེམས་ཅན་ཐམས་ཅད་བསྐྱབ་པར་བྱའོ་སྙམ་དུ་བྱམས་པ་སྒོམ་པ་དང་། བདག་གིས་སེམས་ཅན་ཐམས་ཅད་བསྒྲལ་བར་བྱའོ་སྙམ་དུ་བྱམས་པ་སྒོམ་པ་དང་། བདག་གིས་སེམས་ཅན་ཐམས་ཅད་བསྐུལ་བར་བྱའོ་སྙམ་དུ་བྱམས་པ་སྒོམ་པ་དང་། བདག་གིས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་མྱ་ངན་ལས་བཟླའོ་སྙམ་དུ་བྱམས་པ་སྒོམ་པ་སྟེ།
en: Meditating on loving-kindness thinking ‘May I protect all beings,’ meditating on loving-kindness thinking ‘May I liberate all beings,’ meditating on loving-kindness thinking ‘May I inspire all beings,’ and meditating on loving-kindness thinking ‘May I lead all beings completely beyond suffering.’

source: བཟང་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱམས་པ་སྒོམ་པ་ཡིན་ནོ། །
en: Bhadra, these are the bodhisattvas’ meditations on loving-kindness.

source: བཟང་པོ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྙིང་རྗེ་ཡིན་ཏེ།
en: “Bhadra, these four are the compassions of bodhisattvas.

source: ངན་སོང་དུ་སྐྱེས་པ་རྣམས་བདེ་འགྲོའི་ལམ་ལ་འགོད་པའི་སྙིང་རྗེ་དང་། སྡིག་པའི་ལས་དང་ལྡན་པ་རྣམས་དགེ་བའི་ཆོས་ལ་སྦྱོར་བའི་སྙིང་རྗེ་དང་། ཐེག་པ་དམན་པ་ལ་མོས་པ་རྣམས་ཐེག་པ་ཆེན་པོ་ཡང་དག་པར་ལེན་དུ་འཇུག་པའི་སྙིང་རྗེ་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་མྱ་ངན་ལས་བཟླའོ་སྙམ་པའི་སྙིང་རྗེ་ནི་བཞི་པ་ཡིན་ཏེ།
en: The compassion of putting those born in lower realms onto the path to higher realms, the compassion of joining those with bad karma to virtuous qualities, the compassion of leading those inclined toward the Lesser Vehicle to correctly practice the Greater Vehicle, and, fourth, the compassion of thinking ‘May I lead all beings completely beyond suffering!’

source: བཟང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་མངོན་པར་ཤེས་པ་འཐོབ་པར་འགྱུར་ཏེ།
en: “Bhadra, when bodhisattvas have four qualities, they will obtain the superknowledges.

source: ལུས་དང་སེམས་ཡང་བ་དང་། སྒྱུ་མའི་རང་བཞིན་དུ་རྣམ་པར་འབྱེད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་གུས་པ་དང་། རིམ་གྲོའི་སེམས་བསྐྱེད་པ་དང་། ཞི་གནས་ལ་རྩེ་གཅིག་ཏུ་གྱུར་པས་རྣམ་པར་གཡེང་བ་མེད་པ་ཡིན་ནོ། །
en: Lightness of body and mind, discerning the illusory nature, cultivating a mind of respect and service toward all beings, and, with calm abiding having become single pointed, being without distraction.

source: བཟང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་སོ་སོ་ཡང་དག་པར་རིག་པ་འཐོབ་པར་འགྱུར་ཏེ།
en: “Bhadra, when bodhisattvas have four qualities, they will obtain the correct discernments.

source: དོན་ལ་རྟོན་པ་ཡིན་གྱི་ཚིག་འབྲུ་ལ་མི་རྟོན་པ་དང་། ཆོས་ལ་རྟོན་པ་ཡིན་གྱི་གང་ཟག་ལ་མི་རྟོན་པ་དང་། ཆོས་ཐམས་ཅད་བདག་མེད་པའི་ངེས་པའི་ཚིག་དང་། ཡི་གེ་མི་ཟད་པར་ཤེས་ནས་ཆགས་པ་མེད་ཅིང་ཐོགས་པ་མེད་པར་སྟོན་པས་སྟོན་པར་བྱེད་པ་སྟེ་བཞི་པོ་དེ་དག་ཡིན་ནོ། །
en: Relying on the meaning and not on the words, relying on the Dharma and not on persons, knowing all phenomena to be without identity and to be language and words that are inexhaustible, and teaching without attachment or obstruction.

source: བཟང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་གཟུངས་འཐོབ་པར་འགྱུར་ཏེ།
en: These are the four. “Bhadra, when bodhisattvas have four qualities, they obtain retention.

source: མང་དུ་ཐོས་པས་ངོམས་མི་ཤེས་པ་དང་། མང་དུ་ཐོས་པ་རྣམས་ལ་ཆོས་བཞིན་དུ་གུས་པར་བསྙེན་བཀུར་བྱེད་པ་དང་། རྟག་ཏུ་གཞན་དག་ལ་ཆོས་སྟོན་པར་བརྩོན་པ་དང་། ཚིག་དང་ཡི་གེ་ཐམས་ཅད་གཏན་ལ་དབབ་པའི་ཕྱིར་དེ་བཞིན་གཤེགས་པས་དགོངས་ཏེ་གསུངས་པ་ལ་འཇུག་པ་ཡིན་ནོ། །
en: Not being satisfied even though they have learned a great deal, honoring and respecting those of great learning in accordance with the Dharma, always striving to teach the Dharma to others, and engaging with the teachings in accordance with the Tathāgata’s intentions in order to definitively determine the meaning of all its words and letters.

source: བཟང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་བཟོད་པ་འཐོབ་པར་འགྱུར་ཏེ།
en: “Bhadra, when bodhisattvas have four qualities, they will obtain acceptance.

source: མོས་པ་དང་། ཕྱིར་མི་ལྡོག་པ་དང་། ཚོགས་པ་དང་། ཡོངས་སུ་མི་སྐྱོ་བ་སྟེ།
en: Faith, irreversibility, accumulation, and indefatigability.

source: བཟང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་སྤོབས་པ་དག་པ་འཐོབ་པར་འགྱུར་ཏེ།
en: “Bhadra, when bodhisattvas have four qualities, they will acquire inspired speech.

source: ཆོས་སྨྲ་བ་གཞན་དག་གིས་བཤད་པ་དང་འགལ་བར་མི་བྱེད་པ་དང་། ཆོས་སྨྲ་བ་ལ་གུས་པ་དང་བཅས་ཤིང་ཞེ་ས་དང་བཅས་པར་ཆོས་ཉན་པ་དང་། ཐོས་པས་ཁེངས་པ་མེད་པ་དང་།
en: Not contradicting the explanations of other proponents of the Dharma, listening to the teachings of other proponents of Dharma with respect and commendation, being without conceit despite one’s learning, and not deprecating those of lesser learning.

source: ཐོས་པ་ཉུང་ངུ་རྣམས་ལ་བརྙས་པར་མི་བྱེད་པ་སྟེ་བཞི་པོ་དེ་དག་ཡིན་ནོ། །
en: These are the four.

source: བཟང་པོ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྒྱུར་བ་སྟེ།
en: “Bhadra, these four are the bodhisattvas’ transformations.

source: བཞི་གང་ཞེ་ན། འདོད་ཆགས་དང་།
en: What are the four?

source: ཞེ་སྡང་དང་། གཏི་མུག་སྒྱུར་བ་དང་། ཉན་ཐོས་ལས་སྒྱུར་བ་དང་། རང་སངས་རྒྱས་ལས་སྒྱུར་བ་དང་། དགེ་བའི་རྩ་བའི་ཆོས་ལ་འདུ་ཤེས་སྒྱུར་བ་སྟེ།
en: The transformation of desire, anger, and ignorance, the transformation from a śrāvaka, the transformation from a pratyekabuddha, and the transformation of perceptions into Dharmic roots of virtue.

source: བཟང་པོ་ཆོས་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དོན་ཟབ་མོ་ལ་སྦྱོར་བ་ཡིན་ཏེ།
en: “Bhadra, these four qualities are bodhisattvas’ engagement with profound meaning.

source: རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བར་རྟོགས་པར་བྱེད་པ་དང་། དགོངས་པ་རྟོགས་པར་བྱེད་པ་དང་། བདག་གི་ངོ་བོ་ཉིད་རྟོགས་པར་བྱེད་པ་དང་། འདི་ལྟར་སྟོང་པའི་དོན་དུ་ཆོས་དེ་དག་ཐམས་ཅད་དོན་གཅིག་པར་རྟོགས་པར་བྱེད་པ་སྟེ།
en: Understanding dependent arising, understanding the intent of the teachings, understanding the nature of identity, and likewise understanding that, from the perspective of emptiness, all these phenomena have the same meaning.
